Merge branch 'd2'
